#____________________________________________________________________
#1. Проверка на подмножество
#____________________________________________________________________
set1 = {1, 2, 3, 4}
set2 = {2, 3}
#v.1.1
print(set1 >= set2)
print(set2 <= set1)
#v.1.2
print(set2.issubset(set1))
print(set1.issuperset(set2))
#v.2.1
flag = True
for item in set2:
    if item not in set1:
        flag = False
        break
print(flag)
#____________________________________________________________________
#2. Зеркальное подмножество
#____________________________________________________________________
set1 = {2, 3, 4, 5, 6}
set2 = {4, 5}
if set2 >= set1:
    print("Подмножество:", True)
    print("Разница:", set2 - set1)
elif set1 >= set2:
    print("Подмножество:", True)
    print("Разница:", set1 - set2)
else:
    print("Подмножество:", False)

