# #1) Таблица умножения
#------------------------------------------------------------------------------
# number = int(input("Введите число: "))
# row = 1
# column = 1
#
# for i in range(number * number):
#     print(row * column, end="\t")
#     column += 1
#
#     if column > number:
#         print("\n", end="")
#         column = 1
#         row += 1

#------------------------------------------------------------------------------
#2) Лестница чисел
#------------------------------------------------------------------------------
# number = int(input("Введите число: "))
# row = 1
# column = 1
#
# for i in range(1000):
#     print(column, end=" ")
#     column += 1
#
#     if column > row:
#         print("\n", end="")
#         row += 1
#         column = 1
#
#     if row > number:
#         break
#------------------------------------------------------------------------------
#3) Удаление всех повторяющихся символов
#------------------------------------------------------------------------------
string = input("Введите строку: ")
temp = ''

for char in string:
    if char not in temp:
        temp += char
print("Результат:", temp)
