#1)
#-----------------------------------------------------------------------------
price = int(input("Введите стоимость товара: "))

coins = [50, 10, 5, 2, 1]

for i in coins:
    count = price // i
    if count > 0:
        print("Внесите монеты номиналом ", i, ":", " ", count, sep='')
        price = price - count * i

#-----------------------------------------------------------------------------
#2) Квадрат нечетных чисел
#-----------------------------------------------------------------------------
# numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]
# print('Изначальный список:', numbers)
#
# for i in range(len(numbers)):
#     if numbers[i] % 2 == 0:
#         continue
#     else:
#         numbers[i] = numbers[i] ** 2
# print('Измененный список:', numbers)

