#____________________________________________________________________
#2.Сумма положительных чисел
#____________________________________________________________________
numbers = [1245.4435, -302.1403, 87459.99, -520.8265, 1450.001]
sum = 0

for i in numbers:
    if i > 0:
        sum += i
print(f"${sum:,.2f}")

#____________________________________________________________________
#2.Счета клиентов
#____________________________________________________________________
data_list = [
    "John 23 12345.678",
    "Alice 30 200.50",
    "Bob 35 15000.3",
    "Charlie 40 500.75"]

for char in data_list:
    every_part = char.split()
    print(f"Имя: {every_part[0]:<10} | Возраст: {int(every_part[1]):>3} | Баланс: {float(every_part[2]):>10.2f}")
