#1) Торговый автомат
#-----------------------------------------------------------------------------
# price = int(input("Введите стоимость товара: "))
#
# coins = [50, 10, 5, 2, 1]
#
# for i in coins:
#     count = price // i
#     if count > 0:
#         print("Внесите монеты номиналом ", i, ":", " ", count, sep='')
#         price = price - count * i

#-----------------------------------------------------------------------------
#2) Квадрат нечетных чисел
#-----------------------------------------------------------------------------
# numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]
# print('Изначальный список:', numbers)
#
# for i in range(len(numbers)):
#     if numbers[i] % 2:
#       numbers[i] = numbers[i] ** 2
#     #else: #лишнее и так будет continue
#      #   continue
# print('Измененный список:', numbers)
#-----------------------------------------------------------------------------
# cost = int(input("Введите стоимость товара: "))
# funfzig = cost//50
# zehn = (cost-(50*funfzig))//10
# funf = (cost-(10*zehn+50*funfzig))//5
# zwei = (cost-(5*funf+10*zehn+50*funfzig))//2
# eins = (cost-(2*zwei+5*funf+10*zehn+50*funfzig))//1
# print(f"Внесите монеты номиналом 50: {funfzig}",
#       f"Внесите монеты номиналом 10: {zehn}",
#       f"Внесите монеты номиналом 5: {funf}",
#       f"Внесите монеты номиналом 2: {zwei}",
#       f"Внесите монеты номиналом 1: {eins}",
#       sep="\n")