#____________________________________________________________________
#1. Не уникальные числа
#____________________________________________________________________
numbers = [4, 7, 3, 7, 8, 3, 4, 2, 7, 3, 8, 4]

result = {number for number in set(numbers) if numbers.count(number) > 1}
print(sorted(result, reverse=True))

#____________________________________________________________________
#2. Проверка подмножества
#____________________________________________________________________
dict1 = {"a": 1, "b": 2}
dict2 = {"a": 1, "b": 2, "c": 3}

if set(dict1.items()).issubset(set(dict2.items())):
    print("Первый словарь является подмножеством второго.")
else:
    print("Первый словарь НЕ является подмножеством второго.")

#РаспакоУка
# for key, value in dict1.items():
#     print(key, value)

